app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "desc", "price", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Bad Boys 1"], ["desc", "Bad Boys returned"], ["price", 3.0], ["picture", ""], ["created_at", "2020-01-30 17:07:58.249960"], ["updated_at", "2020-01-30 17:07:58.249960"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save